/*
Теоретичні питання{
 1. Щоб оголосити змінну, ми використовуємо одне з трьох ключових слів: let, const, var. Потім називаємо цю змінну.
 2. Prompt показує модальне вікно з запитанням/повідомленням і полем, де користувач може ввести свою відповідь, а також кнопки OK і Cancel. Confirm показує модальне вікно з запитанням/ повідомленням і кнопки OK і Cancel, тобто користувач не може ввести свою відповідь, лише вибрати між двома кнопками. 
 3. Неявне перетворення типів це коли типи даних перетворюються автоматично, без попереднього втручання людини. Прикладом може бути не строге порівняння(==) значень, тому що вони автоматично перетворюються на тип даних number: alert(”2”==2) // поверне true, тому що значення string "2" перетвориться в число 2, а 2==2.
}
 */

//Завдання1
const name = "Hanna";
let admin;
admin = name;
console.log(admin);

//Завдання2
let days = 4;
days = days * 60 * 60 * 24; //в 4 днях 345600 секунд 
console.log(days);

//Завдання3
console.log(prompt("Введи довільне значення: "));