/*
Теоретичні питання{
1. Цикли  ми використовуємо, якщо ми маємо кусок кода, якій потрібно повторювати якусь кількість раз, і щоб не писати кожний раз одинаковий кусок кода(бо таких разів може бути і 1000 і більше), його можна помістити в цикл, якій буде виповнювати наш кусок кода стільки раз, скільки потрібно, щоб не дублювати цей кусок в коді. 
2. Цикл for ми використовуємо, якщо нам потрібно повторити кусок кода якусь контретну кількість раз, яку ми знаємо. Цикл while ми використовуємо, коли нам потрібно повторити кусок кода, але ми не знаємо скільки саме раз він буде повторюватись. Цикл do while використовується при тих самих умовах як і while, але в while спершу перевіряється умова і якщо вона буде false то цикл ні разу не виконається, a do while в любому випадку спочатку виконає перший раз кусок кода, а потім перевірить на умову і якщо буде false, то всеодно наш код лише раз, але виконається.
3. Явне перетворення типів, це коли людина сама прописує яке потрібно перетворення типів. А неявне перетворення типів виконується автоматично.
}
*/

//Завдання
let number = +prompt("Your number: ");
while (!Number.isInteger(number)) {
    number = +prompt("your number is float, please enter integer number: ")
}
if (number < 5) { //якщо число > або = 5, то одне число яке ділиться на 5 уже буде(5)
    console.log("Sorry, no numbers");
} else {
    for (let i = 0; i <= number; i++){
    if (i % 5 === 0) {
        console.log(i);
    }
}
}